benchmarks/http_suite_20260323_141505/wrk_ping_io8_c256.wrk.out
Running 5s test @ http://127.0.0.1:18080/ping
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.50ms    1.88ms  45.14ms   74.86%
    Req/Sec     7.15k   541.32    12.85k    77.00%
  Latency Distribution
     50%    3.91ms
     75%    5.60ms
     90%    7.11ms
     99%    9.86ms
  284737 requests in 5.02s, 31.23MB read
Requests/sec:  56718.74
Transfer/sec:      6.22MB