benchmarks/http_suite_20260323_141505/wrk_ping_session_on_c256.wrk.out
Running 5s test @ http://127.0.0.1:18080/ping
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.10ms    2.60ms  38.97ms   78.33%
    Req/Sec     5.32k   658.36    12.00k    90.07%
  Latency Distribution
     50%    5.23ms
     75%    6.66ms
     90%    9.76ms
     99%   14.49ms
  213573 requests in 5.10s, 34.72MB read
Requests/sec:  41878.70
Transfer/sec:      6.81MB